/*
 * Введите экзаменационные оценки студента по 3 предметам и напечатайте его статус: 
 * «отличник», «хорошист», «троечник», «двоечник»
*/

//#include <stdio.h>
//#include <locale.h>
//
//
//int main()
//{
//	setlocale(LC_CTYPE, "Russian");
//
//	int ret1, ret2, ret3;
//	ret1 = ret2 = ret3 = 0;
//	int reting = 0;
//
//	printf("Введите три экзаменационные оценки студента (через пробел): ");
//	scanf("%d %d %d", &ret1, &ret2, &ret3);
//
//	reting = (ret1 == 5 && ret2 == 5 && ret3 == 5) ? 5 :
//		(ret1 == 2 || ret2 == 2 || ret3 == 2) ? 2 :
//		(ret1 == 3 || ret2 == 3 || ret3 == 3) ? 3 :
//		(ret1 == 4 || ret2 == 4 || ret3 == 4) ? 4 : 0;
//
//	printf("Оценки студента: %d %d %d\n", ret1, ret2, ret3);
//	printf("Студент - %s\n", (reting == 5 ? "отличник" : 
//		(reting == 4) ? "хорошист" :
//		(reting == 3) ? "троечник" :
//		(reting == 2) ? "двоечник" : "оценки нет!!!"));
//
//	return 0;
//}