/*
 * К введенному числу (от 0 до 99) приписать слово «копеек» в правильном падеже
 */

//#include <stdio.h>
//#include <locale.h>
//
//
//int main()
//{
//	setlocale(LC_CTYPE, "Russian");
//
//	int num = 0;
//	printf("Введите число в диапазоне от 0 до 99: ");
//	scanf("%d", &num);
//
//	/*for (num; num <= 99; num++) {*/
//		printf("Вы ввели %d %s!\n", num, (num == 0 || (num >= 5 && num <= 20) ||
//			((num % 10) >= 5 && (num % 10) <= 9) || (num % 10) == 0 ? "копеек" :
//			(num >= 1 && num <= 4) || (num % 10) == 1 ? "копейка" :
//			(num % 10) >= 2 && (num % 10) <= 4 ? "копейки" : "не знаю"));
//	/*}*/
//
//	return 0;
//}