/*
 *   введенному числу (от 0 до 10Е0.99) приписать слова Ђрублейї и Ђкопеекї в правильном падеже
 */

 //#include <stdio.h>
 //#include <locale.h>
 //
 //
 //int main()
 //{
 //	setlocale(LC_CTYPE, "Russian");
 //
 //	int rub = 0, kop = 0;
 //	printf("¬ведите число в диапазоне от 0 до 10Е0.99: ");
 //	scanf("%d.%d", &rub ,&kop);

	///*for (num; num <= 99; num++) {*/
	//printf("¬ы ввели %d %s", rub, (rub == 0 || (rub >= 5 && rub <= 20) ||
	//	((rub % 10) >= 5 && (rub % 10) <= 9) || (rub % 10) == 0 ? "рублей" : // 0, 5-20, 25-29.., 30..
	//	(rub >= 2 && rub <= 4) || (rub % 10) >= 2 && (rub % 10) <= 4 ? "рубл€" : // 2-4, 22-24...
	//	(rub % 10) == 1 ? "рубль" : "не знаю")); // 21, 31...

 //		printf(" %d %s!\n", kop, (kop == 0 || (kop >= 5 && kop <= 20) ||
 //			((kop % 10) >= 5 && (kop % 10) <= 9) || (kop % 10) == 0 ? "копеек" :
 //			(kop >= 1 && kop <= 4) || (kop % 10) == 1 ? "копейка" :
 //			(kop % 10) >= 2 && (kop % 10) <= 4 ? "копейки" : "не знаю"));
 //	/*}*/
 //
 //	return 0;
 //}