/*
 * К введенному числу (от 0 до 1000) приписать слово «рублей» в правильном падеже
 */

//#include <stdio.h>
//#include <locale.h>
//
//
//int main()
//{
//	setlocale(LC_CTYPE, "Russian");
//
//	int num = 0;
//	printf("Введите число в диапазоне от 0 до 1000: ");
//	scanf("%d", &num);
//
//	num = (num >= 100) ? num % 100 : num; // приведение числа к диапазону от 0 до 99
//
//	/*for (num; num <= 99; num++) {*/
//	printf("Вы ввели %d %s!\n", num, (num == 0 || (num >= 5 && num <= 20) ||
//		((num % 10) >= 5 && (num % 10) <= 9) || (num % 10) == 0 ? "рублей" : // 0, 5-20, 25-29.., 30..
//		(num >= 2 && num <= 4) || (num % 10) >= 2 && (num % 10) <= 4 ? "рубля" : // 2-4, 22-24...
//		(num % 10) == 1 ? "рубль" : "не знаю")); // 21, 31...
//	/*}*/
//
//	return 0;
//}
 