/*
* Образуют ли цифры четырехзначного числа арифметическую прогрессию
*/

//#include <stdio.h>
//#include <locale.h>
//#include <math.h>
//
//
//int main()
//{
//	setlocale(LC_CTYPE, "Russian");
//	int num = 0; // 1234
//	int n1, n2, n3, n4;
//	n1 = n2 = n3 = n4 = 0;
//	int ansver;
//
//	control_point:
//	printf("Введите четырхзначное число: ");
//	scanf("%d", &num);
//
//	if ((num / 10000) > 0) { // проверка на ввод (можно убрать)
//		printf("Введенное число больше четырех знаков. Повторите воод!\n");
//		goto control_point;
//	}
//
//	n1 = num % 10; // 1234 % 10 = 4
//	n2 = (num % 100) / 10; // (1234 % 100 = 34) / 10 = 3
//	n3 = (num % 1000) / 100; // ((1234 % 1000) = 234) / 100 = 2
//	n4 = (num / 1000); // 1234 / 1000 = 1
//	//printf("%d %d %d\n", n1 - n2, n2 - n3, n3 - n4);
//	ansver = ((n1 - n2) == (n2 - n3) && (n2 - n3) == (n3 - n4)) ? 1 : 0;
//	
//	printf("Число %d %s", num, (ansver == 1 ? "является " : "не является "));
//	//printf("Число %d %s", num, " sss ");
//	printf("арифметической прогрессией!\n");
//
//	//printf("%d-%d-%d-%d\n", n4, n3, n2, n1);
//
//	return 0;
//}