/* 200217
 * Эксперементы с функцией printf
 */

//#include <stdio.h>
//#include <locale.h>
//
//int main()
//{
//	setlocale(LC_CTYPE, "rus");
////+----------------------------------------------------------
//	printf("+----------------------------------------------------------\n");
//	printf("Вывод целое десятичное со знаком (%%d): %d\t%d\t%d\n", 5, 0, -7);
//	printf("Вывод целое десятичное со знаком (%%i): %i\t%i\t%i\n", 5, 0, -7);
//	printf("Вывод целое десятичное без знака (%%u): %u\t%u\t%u\n", 5, 0, 7);
//	printf("Вывод целого восьмеричное без знака (%%o): %o\t%o\t%o\n", 1559, 9, 011);
//	printf("Вывод целое шестнадцатеричное без знака \nс символами a, b, c, d, e, f"
//		"(%%x): %x\t%x\t%x\n", 1565, 15, 016);
//	printf("то же, что и для x, но с символами A, B, C, D, E, F"
//		"(%%X): %X\t%X\t%X\n", 1565, 15, 016);
//	printf("+----------------------------------------------------------\n");
////+----------------------------------------------------------
//	printf("Вывод значение в форме [ - ] ...dd.dddddd(%%f): %f\t%f\t%f\n", 5.f, 0.f, -7.f);
//	printf("Вывод значение в форме [ - ] d.dddddde[ +/-] ddd(%%e): %e\t%e\t%e\n", 5.f, 0.f, -7.f);
//	printf("Вывод значение в форме eили fв зависимости от его величины и точности;\n" 
//		"незначащие нули и десятичная точка печатаются\n"
//		"только при необходимости(%%g): %g\t%g\t%g\n", 5.f, 0.f, -700000000.f);
//	printf("Вывод тот же, что и для e, но экспонента обозначается\n"
//		"символом E (%%E): %E\t%E\t%E\n", 5.f, 0.f, -7.f);
//	printf("Вывод тот же, что и для g,\n"
//		"но с символом E для экспоненты (%%G): %G\t%G\t%G\n", 5.f, 0.f, -7000000000.f);
//	printf("+----------------------------------------------------------\n");
////+----------------------------------------------------------
//	printf("Вывод отдельный символ (%%c): %c\t%c\t%c\n", 'a', 'T', 'R');
//	printf("Вывод печатаются символы строки,\n"
//		"пока не встретится символ \'\\0\' (%%s): %s%s%s\n", "Hello", ", world", "!");
//	printf("+----------------------------------------------------------\n");
////+----------------------------------------------------------
//	printf("Вывод печатается символ %% (%%): \n");
//	printf("По указанному адресу запоминается количество\n"
//		"напечатанных к этому моменту символов.\nПример\n: ");
//	int nVar = 0;
//	/*Because the %n format is inherently insecure, it is disabled by default. 
//	 *If %n is encountered in a format string, the invalid parameter handler is 
//	 *invoked, as described in Parameter Validation. To enable %n support, 
//	 *see _set_printf_count_output.
//	 */
//
//  	printf("Значение функции _get_printf_count_output() = %d\n", _get_printf_count_output());
//	_set_printf_count_output(1);
//	printf("Значение функции _get_printf_count_output() = %d\n", _get_printf_count_output());
//
//
//	printf("%s%n\n", "Hello!", &nVar);
//	printf("Количество символов: n = %d\n", nVar);
//	_set_printf_count_output(0);
//
//	int pn = 0;
//	int *Pn = &pn;
//	int *pNULL = NULL;
//	printf("Вывод аргумент печатается как указатель (%%p): %p\n", &pn);
//	printf("Вывод аргумент печатается как указатель (%%p): %p\n", Pn);
//	printf("Вывод аргумент печатается как указатель NULL (%%p): %p\n", pNULL);
//	
//	return 0;
//}